Revit 2027 API
IIFCEntityTreeUIServer Interface
 The interface used to provide UI on IFC Entity selection.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IIFCEntityTreeUIServer : IExternalServer
Public Interface IIFCEntityTreeUIServer
	Inherits IExternalServer
public interface class IIFCEntityTreeUIServer : IExternalServer
type IIFCEntityTreeUIServer =
    interface
        interface IExternalServer
    end
The IIFCEntityTreeUIServer type exposes the following members.
Methods
Name | Description
GetDescription |  Implement this method to return a description of the server.
(Inherited from IExternalServer)
GetName |  Implement this method to return the name of the server.
(Inherited from IExternalServer)
GetServerId |  Implement this method to return the id of the server.
(Inherited from IExternalServer)
GetServiceId |  Implement this method to return the id of the service.
(Inherited from IExternalServer)
GetVendorId |  Implement this method to return the id of the vendor of the server.
(Inherited from IExternalServer)
ShowDialog |  Shows dialog on managing IFCEntityTreeUI.
Top
See Also
Reference
Autodesk.Revit.UI Namespace